Documentacao/Exemplos XML/Sync/retificarEntradaMedicamento.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hor="http://www.saude.gov.br/horus-ws/schemas/v1/HorusTypes">
   <soapenv:Header/>
   <soapenv:Body>
      <hor:retificarEntradaMedicamento>
         <identificacao>
            <idOrigem>E</idOrigem>
            <coIBGE>23</coIBGE>
            <nuProtocoloEntrada>17100000023000003139</nuProtocoloEntrada>
         </identificacao>
         <estabelecimento>
            <coCNES>5717493</coCNES>
            <coTipoEstabelecimento>A</coTipoEstabelecimento>
         </estabelecimento>
         <produto>
            <coRegistroOrigem>123</coRegistroOrigem>
            <nuProduto>EBR0266630U0118</nuProduto>
            <nuLote>12345</nuLote>
            <dtValidade>01-01-2020</dtValidade>
            <qtProduto>12</qtProduto>
            <dtRegistro>30-10-2017</dtRegistro>
            <sgProgramaSaude>DST</sgProgramaSaude>
            <nuCNPJFabricante>00530493000171</nuCNPJFabricante>
            <nuNotaFiscal>1324</nuNotaFiscal>
            <nuValorUnitario>1234.1234</nuValorUnitario>
            <nuCNPJDistribuidor>00530493000171</nuCNPJDistribuidor>
            <tpEntradaEstoque>E-O</tpEntradaEstoque>
            <coRegistro>5090</coRegistro>
         </produto>
      </hor:retificarEntradaMedicamento>
   </soapenv:Body>
</soapenv:Envelope>